<a href="https://colab.research.google.com/github/JosefinaArayaTapia/CursoPandas/blob/main/Dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
pd.__version__

'1.2.3'

In [ ]:
!pip install --upgrade pandas

In [ ]:
dic_data = {'CH':[100,800,200], 'CO':[100,200,300], 'MX':[300,500,400]}
dic_data

{'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}

In [ ]:
df= pd.DataFrame(dic_data)
df

    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

In [ ]:
import numpy as np

In [ ]:
dict_data2 = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
dict_data2

{'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

In [ ]:
dfData= pd.DataFrame(dict_data2)
dfData

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

In [ ]:
dfData= pd.DataFrame(dict_data2,index=['Ana','Pedro','Juan','Esteban','Kim','Sasha','Jose'])
dfData

         edad   cm pais genero    Q1  Q2
Ana        10  115   co      M   5.0   7
Pedro       9  110   mx      F  10.0   9
Juan       13  130   co      F   8.0   9
Esteban    14  155   mx      M   NaN   8
Kim        12  125   mx      M   7.0   8
Sasha      11  120   ch      M   8.0   8
Jose       12  125   ch      F   3.0   9

In [ ]:
dfData.index

Index(['Ana', 'Pedro', 'Juan', 'Esteban', 'Kim', 'Sasha', 'Jose'], dtype='object')

In [ ]:
dfData.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [ ]:
dfData.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [ ]:
dfData['edad']

Ana        10
Pedro       9
Juan       13
Esteban    14
Kim        12
Sasha      11
Jose       12
Name: edad, dtype: int64

In [ ]:
dfData[['edad','genero']]

         edad genero
Ana        10      M
Pedro       9      F
Juan       13      F
Esteban    14      M
Kim        12      M
Sasha      11      M
Jose       12      F

In [ ]:
dfData.loc[['Ana','Jose'],['edad','genero']]

      edad genero
Ana     10      M
Jose    12      F

In [ ]:
dfData.loc['Esteban','Q1']

nan

In [ ]:
dfData

         edad   cm pais genero    Q1  Q2
Ana        10  115   co      M   5.0   7
Pedro       9  110   mx      F  10.0   9
Juan       13  130   co      F   8.0   9
Esteban    14  155   mx      M   NaN   8
Kim        12  125   mx      M   7.0   8
Sasha      11  120   ch      M   8.0   8
Jose       12  125   ch      F   3.0   9

In [ ]:
dfData.iloc[1,1]

110

In [ ]:
dfData.iloc[1,[1,3]]

cm        110
genero      F
Name: Pedro, dtype: object

In [ ]:
dfData.iloc[:,[1,3]]

          cm genero
Ana      115      M
Pedro    110      F
Juan     130      F
Esteban  155      M
Kim      125      M
Sasha    120      M
Jose     125      F

In [ ]:
#Condiciones

dfData['edad']>12

Ana        False
Pedro      False
Juan        True
Esteban     True
Kim        False
Sasha      False
Jose       False
Name: edad, dtype: bool

In [ ]:
dfData[dfData['edad']>12]

         edad   cm pais genero   Q1  Q2
Juan       13  130   co      F  8.0   9
Esteban    14  155   mx      M  NaN   8

In [ ]:
dfData[(dfData['edad']>10) & (dfData['pais']=='ch')]

       edad   cm pais genero   Q1  Q2
Sasha    11  120   ch      M  8.0   8
Jose     12  125   ch      F  3.0   9

In [ ]:
dfData.query('edad>10 and pais=="ch"')

       edad   cm pais genero   Q1  Q2
Sasha    11  120   ch      M  8.0   8
Jose     12  125   ch      F  3.0   9

In [ ]:
dfData[dfData['Q2']>dfData['Q1']]

      edad   cm pais genero   Q1  Q2
Ana     10  115   co      M  5.0   7
Juan    13  130   co      F  8.0   9
Kim     12  125   mx      M  7.0   8
Jose    12  125   ch      F  3.0   9